{
    "extensionDescription": {
        "message": "Add quotation marks around text blocks in editor fields. Select the lines you want to quote or put the cursor to the line that should be quoted and press the toolbar button or [Ctrl]+[E].\n\nPlease note that, due to browser restrictions, calling the quote plugin will kill the undo buffer for the text entry field."
    },
    "infoUsage": {
        "message": "<h2>Usage</h2><ul><li>Set the focus (text cursor) in a multiline text field (<code>&lt;textarea&gt;</code>) of any web page)</li><li>Select the lines you want to qoute. If you only want to quote a single line, you don't need to mark any text, just set the cursor to any position within this line. In case you want to mark several lines, just select (highlight) the text range. The start and end of the selection can be on any position within the first and last line - no need te select full lines.</li><li>Now press [Ctrl]+[E] or click the QuoteMe icon in the toolbar.</li></ul>"
    },
    "infoQuoteDrawback": {
        "message": "<h2>Drawback</h2><p>Firefox changed the behaviour of the <code>&lt;textarea&gt;</code>: It now nukes the undo buffer if there are any text changes through JavaScript. There is a <a href='https://bugzilla.mozilla.org/show_bug.cgi?id=1220696#c10'>Bug report</a> without any solution as of the time of writing. This means that after adding quotes through the QuoteMe add-on, you can not undo any previous changes, not even remove the quotes through [Ctrl]+[Z].</p>"
    },
    "infoQuoteSet": {
        "message": "The default version is the predefined short ASCII set; long ASCII adds more dashes. The Unicode sets use combinations of <a href='https://en.wikipedia.org/wiki/Box-drawing_character'>Box-drawing characters</a> while E-Mail adds <code>&gt;</code> to the text block and a literal <code>Quote</code> at the start."
    },
    "infoQuoteStart": {
        "message": "This full line is inserted right before the to-be quoted text."
    },
    "infoQuoteBlock": {
        "message": "These characters are added to each line of the to-be quoted text."
    },
    "infoQuoteStopp": {
        "message": "This full line inserted right after the to-be quoted text."
    },
    "infoQuoteClean": {
        "message": "Clean trailing whitespace characters in each quoted line."
    },
    "infoQuoteSave": {
        "message": "Please note that any changes to the configuration only takes effect if you press the 'Save' button."
    },
    "contextMenuEntry": {
        "message": "Quote lines of text"
    },
    "noTextareaWarning": {
        "message": "Set cursor into text area and mark the lines that should be quoted."
    },
    "settings": {
        "message": "Settings"
    },
    "predefined": {
        "message": "Verdefinierter Satz an Eistellungen"
    },
    "quoteSet": {
        "message": "Quote set:"
    },
    "select": {
        "message": "Select:"
    },
    "asciiShort": {
        "message": "ASCII short"
    },
    "asciiLong": {
        "message": "ASCII long"
    },
    "unicodeLight": {
        "message": "Light Unicode bars"
    },
    "unicodeStrong": {
        "message": "Strong unicode bars"
    },
    "unicodeDouble": {
        "message": "Double unicode bars"
    },
    "eMail": {
        "message": "E-Mail"
    },
    "markers": {
        "message": "Quotation markers"
    },
    "start": {
        "message": "Quote start:"
    },
    "block": {
        "message": "Quote block:"
    },
    "stopp": {
        "message": "Quote stop:"
    },
    "clean": {
        "message": "Clean:"
    },
    "whitespace": {
        "message": "whitespace"
    },
    "save": {
        "message": "Save"
    }
}
